InformationRegisters/ПравилаВеденияАналитик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПравилаВеденияАналитик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяДоходовРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходов</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиАналитики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/СтатьиАналитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СтатьиАналитики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДляВсехДоходов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДляВсехРасходов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СтатьиДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СтатьиДоходов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ПравилаВеденияАналитик</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДвижения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>6</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяАналитики</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиАналитики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СтатьиРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СтатьиРасходов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КатегорияРасходовПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПравилаВеденияАналитик</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДвижения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>6</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяАналитики</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиАналитики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПравилаВеденияАналитик/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПерезаполнитьРегистр() Экспорт
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		Блокировка.Добавить("РегистрСведений.ПравилаВеденияАналитик");
		Блокировка.Заблокировать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СтатьиАналитики.Ссылка КАК СтатьяАналитики,
			|	СтатьиАналитики.ВидДвиженияДляВсехДоходов КАК ВидДвижения
			|ИЗ
			|	Справочник.СтатьиАналитики КАК СтатьиАналитики
			|ГДЕ
			|	СтатьиАналитики.ВидДвиженияДляВсехДоходов <> """"
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СтатьиАналитики.Ссылка КАК СтатьяАналитики,
			|	СтатьиАналитики.ВидДвиженияДляВсехРасходов КАК ВидДвижения
			|ИЗ
			|	Справочник.СтатьиАналитики КАК СтатьиАналитики
			|ГДЕ
			|	СтатьиАналитики.ВидДвиженияДляВсехРасходов <> """"";
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		НакопленныеПравилаДоходов = РезультатЗапроса[0].Выгрузить();
		НакопленныеПравилаРасходов = РезультатЗапроса[1].Выгрузить();
		
		ПерезаполнитьРегистрИтерация(Справочники.СтатьиДоходов.ПустаяСсылка(), НакопленныеПравилаДоходов);
		ПерезаполнитьРегистрИтерация(Справочники.СтатьиРасходов.ПустаяСсылка(), НакопленныеПравилаРасходов);
	
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПерезаполнитьРегистрИтерация(Родитель, НакопленныеПравила)
	Запрос = Новый Запрос;
	
	Если ТипЗнч(Родитель) = Тип("СправочникСсылка.СтатьиДоходов") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СтатьиДоходовПравилаВеденияАналитик.СтатьяАналитики КАК СтатьяАналитики,
			|	СтатьиДоходовПравилаВеденияАналитик.ВидДвижения КАК ВидДвижения
			|ИЗ
			|	Справочник.СтатьиДоходов.ПравилаВеденияАналитик КАК СтатьиДоходовПравилаВеденияАналитик
			|ГДЕ
			|	СтатьиДоходовПравилаВеденияАналитик.Ссылка = &Родитель
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СтатьиДоходов.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СтатьиДоходов КАК СтатьиДоходов
			|ГДЕ
			|	СтатьиДоходов.Родитель = &Родитель";
	ИначеЕсли ТипЗнч(Родитель) = Тип("СправочникСсылка.СтатьиРасходов") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СтатьиРасходовПравилаВеденияАналитик.СтатьяАналитики КАК СтатьяАналитики,
			|	СтатьиРасходовПравилаВеденияАналитик.ВидДвижения КАК ВидДвижения
			|ИЗ
			|	Справочник.СтатьиРасходов.ПравилаВеденияАналитик КАК СтатьиРасходовПравилаВеденияАналитик
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтатьиРасходов КАК СтатьиРасходов
			|		ПО СтатьиРасходовПравилаВеденияАналитик.Ссылка = СтатьиРасходов.Ссылка
			|ГДЕ
			|	СтатьиРасходовПравилаВеденияАналитик.Ссылка = &Родитель
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СтатьиРасходов.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СтатьиРасходов КАК СтатьиРасходов
			|ГДЕ
			|	СтатьиРасходов.Родитель = &Родитель";
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неожиданный тип ссылки Родитель: %1'"), ТипЗнч(Родитель));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаНовыеПравила = РезультатЗапроса[0].Выбрать();
	ВыборкаДочерниеСтатьи = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаНовыеПравила.Следующий() Цикл
		СтрНакопленныеПравила = НакопленныеПравила.Найти(ВыборкаНовыеПравила.СтатьяАналитики, "СтатьяАналитики");
		Если СтрНакопленныеПравила = Неопределено Тогда
			СтрНакопленныеПравила = НакопленныеПравила.Добавить();
			СтрНакопленныеПравила.СтатьяАналитики = ВыборкаНовыеПравила.СтатьяАналитики;
		КонецЕсли;
		
		СтрНакопленныеПравила.ВидДвижения = ВыборкаНовыеПравила.ВидДвижения;
	КонецЦикла;
	
	Если Не Родитель.Пустая() И НакопленныеПравила.Количество() > 0 Тогда
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Найти("СтатьяДоходовРасходов").Установить(Родитель);
		
		Для Каждого СтрНакопленныеПравила Из НакопленныеПравила Цикл
			Запись = НаборЗаписей.Добавить();
			Запись.СтатьяДоходовРасходов = Родитель;
			ЗаполнитьЗначенияСвойств(Запись, СтрНакопленныеПравила, "СтатьяАналитики, ВидДвижения");
		КонецЦикла;
		
		НаборЗаписей.Записать(Ложь);
	КонецЕсли;
	
	Пока ВыборкаДочерниеСтатьи.Следующий() Цикл
		ПерезаполнитьРегистрИтерация(ВыборкаДочерниеСтатьи.Ссылка, НакопленныеПравила.Скопировать());
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
